backend: theano
class_name: Model
config:
  input_layers:
  - [input_19, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - !!python/object/apply:numpy.core.multiarray.scalar
        - !!python/object/apply:numpy.dtype
          args: [i8, 0, 1]
          state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
        - !!binary |
          wAAAAAAAAAA=
      dtype: float32
      name: input_19
      sparse: false
    inbound_nodes: []
    name: input_19
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_61
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - input_19
        - 0
        - 0
        - {}
    name: dense_61
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_62
      trainable: true
      units: 16
      use_bias: true
    inbound_nodes:
    - - - dense_61
        - 0
        - 0
        - {}
    name: dense_62
  name: model_32
  output_layers:
  - [dense_62, 0, 0]
keras_version: 2.0.5
