backend: theano
class_name: Model
config:
  input_layers:
  - [input_23, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 32768]
      dtype: float32
      name: input_23
      sparse: false
    inbound_nodes: []
    name: input_23
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_71
      trainable: false
      units: 256
      use_bias: true
    inbound_nodes:
    - - - input_23
        - 0
        - 0
        - {}
    name: dense_71
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_72
      trainable: false
      units: 16
      use_bias: true
    inbound_nodes:
    - - - dense_71
        - 0
        - 0
        - {}
    name: dense_72
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_73
      trainable: true
      units: 16
      use_bias: true
    inbound_nodes:
    - - - dense_72
        - 0
        - 0
        - {}
    name: dense_73
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_74
      trainable: false
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense_73
        - 0
        - 0
        - {}
    name: dense_74
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_75
      trainable: false
      units: 192
      use_bias: true
    inbound_nodes:
    - - - dense_74
        - 0
        - 0
        - {}
    name: dense_75
  name: model_39
  output_layers:
  - [dense_75, 0, 0]
keras_version: 2.0.5
