backend: theano
class_name: Model
config:
  input_layers:
  - [input_21, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - &id001 !!python/object/apply:numpy.core.multiarray.scalar
        - !!python/object/apply:numpy.dtype
          args: [i8, 0, 1]
          state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
        - !!binary |
          AIAAAAAAAAA=
      dtype: float32
      name: input_21
      sparse: false
    inbound_nodes: []
    name: input_21
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_66
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - input_21
        - 0
        - 0
        - {}
    name: dense_66
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_67
      trainable: true
      units: 16
      use_bias: true
    inbound_nodes:
    - - - dense_66
        - 0
        - 0
        - {}
    name: dense_67
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_69
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - dense_67
        - 0
        - 0
        - {}
    name: dense_69
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_70
      trainable: true
      units: *id001
      use_bias: true
    inbound_nodes:
    - - - dense_69
        - 0
        - 0
        - {}
    name: dense_70
  name: model_38
  output_layers:
  - [dense_70, 0, 0]
keras_version: 2.0.5
