backend: theano
class_name: Model
config:
  input_layers:
  - [input_24, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 192]
      dtype: float32
      name: input_24
      sparse: false
    inbound_nodes: []
    name: input_24
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_76
      trainable: false
      units: 64
      use_bias: true
    inbound_nodes:
    - - - input_24
        - 0
        - 0
        - {}
    name: dense_76
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_77
      trainable: false
      units: 16
      use_bias: true
    inbound_nodes:
    - - - dense_76
        - 0
        - 0
        - {}
    name: dense_77
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_78
      trainable: true
      units: 16
      use_bias: true
    inbound_nodes:
    - - - dense_77
        - 0
        - 0
        - {}
    name: dense_78
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_79
      trainable: false
      units: 256
      use_bias: true
    inbound_nodes:
    - - - dense_78
        - 0
        - 0
        - {}
    name: dense_79
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_80
      trainable: false
      units: 32768
      use_bias: true
    inbound_nodes:
    - - - dense_79
        - 0
        - 0
        - {}
    name: dense_80
  name: model_40
  output_layers:
  - [dense_80, 0, 0]
keras_version: 2.0.5
