backend: theano
class_name: Model
config:
  input_layers:
  - [input_6, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 192]
      dtype: float32
      name: input_6
      sparse: false
    inbound_nodes: []
    name: input_6
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_16
      trainable: false
      units: 64
      use_bias: true
    inbound_nodes:
    - - - input_6
        - 0
        - 0
        - {}
    name: dense_16
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_17
      trainable: false
      units: 2
      use_bias: true
    inbound_nodes:
    - - - dense_16
        - 0
        - 0
        - {}
    name: dense_17
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_18
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - dense_17
        - 0
        - 0
        - {}
    name: dense_18
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_19
      trainable: false
      units: 256
      use_bias: true
    inbound_nodes:
    - - - dense_18
        - 0
        - 0
        - {}
    name: dense_19
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_20
      trainable: false
      units: 32768
      use_bias: true
    inbound_nodes:
    - - - dense_19
        - 0
        - 0
        - {}
    name: dense_20
  name: model_10
  output_layers:
  - [dense_20, 0, 0]
keras_version: 2.0.5
