backend: theano
class_name: Model
config:
  input_layers:
  - [input_29, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 32768]
      dtype: float32
      name: input_29
      sparse: false
    inbound_nodes: []
    name: input_29
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_91
      trainable: false
      units: 256
      use_bias: true
    inbound_nodes:
    - - - input_29
        - 0
        - 0
        - {}
    name: dense_91
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_92
      trainable: false
      units: 32
      use_bias: true
    inbound_nodes:
    - - - dense_91
        - 0
        - 0
        - {}
    name: dense_92
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_93
      trainable: true
      units: 32
      use_bias: true
    inbound_nodes:
    - - - dense_92
        - 0
        - 0
        - {}
    name: dense_93
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_94
      trainable: false
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense_93
        - 0
        - 0
        - {}
    name: dense_94
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_95
      trainable: false
      units: 192
      use_bias: true
    inbound_nodes:
    - - - dense_94
        - 0
        - 0
        - {}
    name: dense_95
  name: model_49
  output_layers:
  - [dense_95, 0, 0]
keras_version: 2.0.5
