backend: theano
class_name: Model
config:
  input_layers:
  - [input_7, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - &id001 !!python/object/apply:numpy.core.multiarray.scalar
        - !!python/object/apply:numpy.dtype
          args: [i8, 0, 1]
          state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
        - !!binary |
          wAAAAAAAAAA=
      dtype: float32
      name: input_7
      sparse: false
    inbound_nodes: []
    name: input_7
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_21
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - input_7
        - 0
        - 0
        - {}
    name: dense_21
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_22
      trainable: true
      units: 4
      use_bias: true
    inbound_nodes:
    - - - dense_21
        - 0
        - 0
        - {}
    name: dense_22
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_24
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense_22
        - 0
        - 0
        - {}
    name: dense_24
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_25
      trainable: true
      units: *id001
      use_bias: true
    inbound_nodes:
    - - - dense_24
        - 0
        - 0
        - {}
    name: dense_25
  name: model_14
  output_layers:
  - [dense_25, 0, 0]
keras_version: 2.0.5
