backend: theano
class_name: Model
config:
  input_layers:
  - [input_12, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 192]
      dtype: float32
      name: input_12
      sparse: false
    inbound_nodes: []
    name: input_12
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_36
      trainable: false
      units: 64
      use_bias: true
    inbound_nodes:
    - - - input_12
        - 0
        - 0
        - {}
    name: dense_36
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_37
      trainable: false
      units: 4
      use_bias: true
    inbound_nodes:
    - - - dense_36
        - 0
        - 0
        - {}
    name: dense_37
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_38
      trainable: true
      units: 4
      use_bias: true
    inbound_nodes:
    - - - dense_37
        - 0
        - 0
        - {}
    name: dense_38
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_39
      trainable: false
      units: 256
      use_bias: true
    inbound_nodes:
    - - - dense_38
        - 0
        - 0
        - {}
    name: dense_39
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_40
      trainable: false
      units: 32768
      use_bias: true
    inbound_nodes:
    - - - dense_39
        - 0
        - 0
        - {}
    name: dense_40
  name: model_20
  output_layers:
  - [dense_40, 0, 0]
keras_version: 2.0.5
