backend: theano
class_name: Model
config:
  input_layers:
  - [input_14, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 8]
      dtype: float32
      name: input_14
      sparse: false
    inbound_nodes: []
    name: input_14
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_44
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - input_14
        - 0
        - 0
        - {}
    name: dense_44
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_45
      trainable: true
      units: !!python/object/apply:numpy.core.multiarray.scalar
      - !!python/object/apply:numpy.dtype
        args: [i8, 0, 1]
        state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
      - !!binary |
        wAAAAAAAAAA=
      use_bias: true
    inbound_nodes:
    - - - dense_44
        - 0
        - 0
        - {}
    name: dense_45
  name: model_23
  output_layers:
  - [dense_45, 0, 0]
keras_version: 2.0.5
