backend: theano
class_name: Model
config:
  input_layers:
  - [input_17, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 32768]
      dtype: float32
      name: input_17
      sparse: false
    inbound_nodes: []
    name: input_17
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_51
      trainable: false
      units: 256
      use_bias: true
    inbound_nodes:
    - - - input_17
        - 0
        - 0
        - {}
    name: dense_51
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_52
      trainable: false
      units: 8
      use_bias: true
    inbound_nodes:
    - - - dense_51
        - 0
        - 0
        - {}
    name: dense_52
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_53
      trainable: true
      units: 8
      use_bias: true
    inbound_nodes:
    - - - dense_52
        - 0
        - 0
        - {}
    name: dense_53
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_54
      trainable: false
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense_53
        - 0
        - 0
        - {}
    name: dense_54
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_55
      trainable: false
      units: 192
      use_bias: true
    inbound_nodes:
    - - - dense_54
        - 0
        - 0
        - {}
    name: dense_55
  name: model_29
  output_layers:
  - [dense_55, 0, 0]
keras_version: 2.0.5
