backend: theano
class_name: Model
config:
  input_layers:
  - [input_18, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 192]
      dtype: float32
      name: input_18
      sparse: false
    inbound_nodes: []
    name: input_18
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_56
      trainable: false
      units: 64
      use_bias: true
    inbound_nodes:
    - - - input_18
        - 0
        - 0
        - {}
    name: dense_56
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_57
      trainable: false
      units: 8
      use_bias: true
    inbound_nodes:
    - - - dense_56
        - 0
        - 0
        - {}
    name: dense_57
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_58
      trainable: true
      units: 8
      use_bias: true
    inbound_nodes:
    - - - dense_57
        - 0
        - 0
        - {}
    name: dense_58
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_59
      trainable: false
      units: 256
      use_bias: true
    inbound_nodes:
    - - - dense_58
        - 0
        - 0
        - {}
    name: dense_59
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_60
      trainable: false
      units: 32768
      use_bias: true
    inbound_nodes:
    - - - dense_59
        - 0
        - 0
        - {}
    name: dense_60
  name: model_30
  output_layers:
  - [dense_60, 0, 0]
keras_version: 2.0.5
